package com.Beta.math_practice;

public class arithmetic {

    public String mQuestions[] = {
            "603□221＋382，□中要填入哪個符號？",
            "2個百、12個十和7個一合起來是多少？",
            "50×600的乘積有幾個0？",
            "把一些茶葉蛋平分分成9堆，每堆有36顆。如果把這些茶葉蛋平分分成36堆，每堆有多少顆？",
            "小萍的錢是小正的6倍，已知小萍有960元，兩人共有幾元？",
            "「38」的十位數字為？",
            "「59」的個位數字為？",
            "「75」是由幾個10和5個1所組成的？",
            "「82」是由8個10和幾個1所組成的？",
            "曉孟排隊買電影票，她數了數前面排了25個人，請問曉孟排在第幾個位置？",
            "8.以琳參加馬拉松的排名是第54名，請問排名在以琳前面的人有幾位？",
            "「一千五百零三」可記作下面哪一個數字？",
            "安安買了一件350元的衣服和一件400多元的褲子，大約共花了多少元？",
            "水梨禮盒每盒可以裝10個，裝滿4盒，共有多少個水梨？",
            "被乘數是17，乘數是0，積是多少？",
            "17×5比17×3多多少？",
            "95－（38－14）的答案是多少？",
            "下面哪一個答案是錯的？",
            "33＋12×5的答案是多少？",
            "63＋17×3的答案是多少？",
            "當哥哥12歲時，小可2歲，現在哥哥的年齡是小可的3倍，哥哥現在幾歲？",
            "哥哥買了一箱蘋果，裡面有20個，把蘋果平分給4個好朋友，每人可以分到幾個？",
            "一瓶鮮奶88元，如果都用10元付，最少要付幾個10元才夠？",
            "1盒布丁有3個，買4盒又2個布丁，總共有幾個布丁？",
            "小新喝了4/5杯杯牛奶，如果用小數表示的話，哪一個是對的？",
            "下面哪一個是錯誤的？",
            "7個0.1和1個1合起來是多少？",
            "小兔的體重一個月平均增加0.3公斤，8個月後會增加幾公斤？",
            "文具店有54盒顏色筆，如果每盒顏色筆有25枝，文具店共有顏色筆多少枝？",
            "6人一起吃晚飯，每人付了$40。後來店員發覺帳單出錯了，退還$15給他們。他們實際共付款多少？",
            "0.772乘以下面哪個數的積最“小”？",
            "紅絲帶2.6公尺，黃絲帶比紅絲帶長1.4倍又長0.75公尺，黃絲帶的長度多少公尺？",
            "1平方公里=＿＿＿＿＿平方公尺",
            "麵包店有Ｙ個麵包，每5個裝成一袋，剛好可以裝成35袋，麵包店有幾個麵包？",
            "同一樣關卡，定價[打七折]和[70%off]，哪樣比較便宜？",
            "下列哪個選項是9*Ｙ=108等式的答案？",
            "阿原有X元的存款，後來又存入2365元，存款裡總共有6850元，阿原原來有多少錢？"
    };


    private String mChoices[][] = {
            {"(A)＞", "(B)＝", "(C)＜", "(D)以上皆非"},
            {"(A)227", "(B)247", "(C)327", "(D)219"},
            {"(A)2", "(B)3", "(C)4", "(D)5"},
            {"(A)7顆", "(B)9顆", "(C)14顆", "(D)16顆"},
            {"(A)1000元", "(B)1080元", "(C)1120元", "(D)1280元"},
            {"(A)2", "(B)3", "(C)4", "(D)8"},
            {"(A)3", "(B)5", "(C)7", "(D)9"},
            {"(A)5", "(B)6", "(C)7", "(D)8"},
            {"(A)1", "(B)2", "(C)4", "(D)8"},
            {"(A)24", "(B)25", "(C)26", "(D)27"},
            {"(A)52", "(B)53", "(C)54", "(D)55"},
            {"(A)1530", "(B)1503", "(C)1350", "(D)1305"},
            {"(A)400", "(B)600", "(C)800", "(D)1200"},
            {"(A)14", "(B)20", "(C)24", "(D)40"},
            {"(A)7", "(B)1", "(C)0", "(D)10"},
            {"(A)17", "(B)34", "(C)2", "(D)15"},
            {"(A)24", "(B)71", "(C)43", "(D)64"},
            {"(A)3＋4×2＝11", "(B)15－6×2＝3", "(C)2＋5×3＝21", "(D)4＋12÷6＝6"},
            {"(A)225", "(B)93", "(C)177", "(D)121"},
            {"(A)240", "(B)114", "(C)206", "(D)226"},
            {"(A)15", "(B)18", "(C)21", "(D)24"},
            {"(A)3", "(B)4", "(C)5", "(D)6"},
            {"(A)8個", "(B)9個", "(C)10個", "(D)88個"},
            {"(A)14", "(B)3", "(C)12", "(D)24"},
            {"(A)5.4杯", "(B)4.5杯", "(C)0.4杯", "(D)0.8杯"},
            {"(A)0.3和0.7合起來是1", "(B)8個0.1是8", "(C)0.6是6個0.1", "(D)18個1毫米是1.8公分"},
            {"(A)0.8", "(B)1.7", "(C)7.1", "(D)8"},
            {"(A)0.24公斤", "(B)0.48公斤", "(C)2.04公斤", "(D)2.4公斤"},
            {"(A)120", "(B)225", "(C)378", "(D)1350"},
            {"(A)$225", "(B)$240", "(C)$255", "(D)$330"},
            {"(A)0.772", "(B)1", "(C)1.6", "(D)0.8"},
            {"(A)3.64", "(B)3.35", "(C)4.39", "(D)4.69"},
            {"(A)100*100", "(B)1000*100", "(C)1000*1000", "(D)1000*10000"},
            {"(A)Y+5=35", "(B)Y/5=35", "(C)35*Y=5", "(D)35/Y=5"},
            {"(A)打七折", "(B)70%off", "(C)一樣便宜", "(D)無法比較"},
            {"(A)972", "(B)99", "(C)117", "(D)12"},
            {"(A)4515", "(B)4385", "(C)4615", "(D)4485"},
    };

    private String mCorrectAnswers[] = {
            "(B)＝",
            "(C)327",
            "(C)4",
            "(B)9顆",
            "(C)1120元",
            "(B)3",
            "(D)9",
            "(C)7",
            "(B)2",
            "(C)26",
            "(B)53",
            "(B)1503",
            "(B)600",
            "(D)40",
            "©0",
            "(B)34",
            "(B)71",
            "(C)2＋5×3＝21",
            "(B)93",
            "(B)114",
            "(A)15",
            "(C)5",
            "(B)9個",
            "(A)14",
            "(D)0.8杯",
            "(B)8個0.1是8",
            "(B)1.7",
            "(D)2.4公斤",
            "(D)1350",
            "(A)$225",
            "(A)0.772",
            "(C)4.39",
            "(C)1000*1000",
            "(B)Y/5=35",
            "(B)70%off",
            "(D)12",
            "(D)4485"
    };

    public String formula() {
        String formula =
                "四則運算規則：\n" +
                        "1. 算式中若只有加減或乘除運算時，由左而右計算\n" +
                        "2. 先算「× ÷」，後算「 + −」（先乘除後加減）\n" +
                        "3. 有括號的，先算括號內的，再算括號外的；\n" +
                        "有多重括號的，先算小括號( )，再算中括號[ ]，最後算大括號{ }\n";
        return formula;
    }


    private String mprompt[] = {
            "把221+382",
            "12個十是120",
            "5*6=30",
            "9*36=324",
            "960/6",
            "從右邊數第二位是十位",
            "從右邊數第一位是個位",
            "看十位數",
            "看個位數",
            "25個加上自己",
            "54個減掉自己",
            "個位數最後念到",
            "350+400=750",
            "10*40",
            "任何數與0相乘都得0",
            "5-3=22個17",
            "括號內要先算",
            "先乘除後加減",
            "先算12*5",
            "先算17*3",
            "答案要符合相差十歲和相差三倍",
            "20/4",
            "8*10=80；9*10=90",
            "3*4+2",
            "4/5=8/10",
            "8*0.1=0.8",
            "7個0.1=0.7",
            "0.3*8",
            "54*25",
            "6*40-15",
            "小數點除以越小的數越小",
            "先乘除後加減",
            "1公里=1000平方公尺",
            "先算出有幾個麵包",
            "70%off-->打三折",
            "9*12=____",
            "總存款扣掉後來的錢"
    };


    public String getprompt(int a) {
        String prompt = mprompt[a];
        return prompt;
    }

    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice = mChoices[a][0];
        return choice;
    }

    public String getChoice2(int a) {
        String choice = mChoices[a][1];
        return choice;
    }

    public String getChoice3(int a) {
        String choice = mChoices[a][2];
        return choice;
    }

    public String getChoice4(int a) {
        String choice = mChoices[a][3];
        return choice;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
