package com.Beta.math_practice;

public class time {
    public String mQuestions[] = {
            "一星期=（）天。",
            "1天=（）小時。",
            "6天＝（）小時。",
            "1小時=（）分鐘。",
            "5小時＝（）分鐘。",
            "1分鐘=（）秒。",
            "20分鐘=（）秒。",
            "1小時23分=（）分。",
            "6分50秒＝（）秒。",
            "爸爸每星期運動5小時，共是幾分鐘？",
            "小安每天做操10分，相當於幾秒？",
            "小如跑操場一圈花了2分鐘，共花了幾秒？",
            "阿文刷牙花了3分5秒，共花了幾秒？",
            "從上午8點到晚上8點，共經過幾個小時？",
            "台灣時間與美國時間相差12小時。如果台灣現在時間為早上7點，請問美國是幾點？",
            "爸爸到外地出差3日，相當於幾小時？",
            "工人花48時才種完所有的花木，相當於幾日？",
            "媽媽每天運動60分鐘，相當於幾小時？",
            "請選擇正確的單位：小朋友一天要睡覺大約要9（）。",
            "史瑞克的片長是1時33分，是幾分鐘？",
            "距離跨年只剩下1日8小時，是幾小時？",
            "6時25分，再經過130分後，是幾時幾分？",
            "捷運兩站間的行駛時間約135秒，是幾分幾秒？",
            "媽媽切一顆蘋果要花2分16秒。她切三顆蘋果要花幾分幾秒？",
            "表姊讀完一份報告平均要花2小時30分鐘。表姊今天讀了10個小時的報告，她讀了幾份報告？",
            "哈哈公司開發的機器人3日16小時可以完成8件成品，平均完成1件成品需要幾個小時？",
            "爺爺搭郵輪到日本旅遊，來回共花了4日16小時，是花了多少小時？",
            "小品花1分15秒可以摺一架紙飛機。請問，連續摺3架紙飛機共要花多少時間？",
            "有一件工程每個人進行的速度都相同，3個工人同時施工需要2日4小時，若只由一個工人施工，要花多少時間？",
            "有一棟大樓，5個清潔工人同時打掃且每個人進行的速度都相同時，需要5日3小時才能打掃完畢。若只由一個清潔工人打掃，要花多少時間？",
            "老師從上午9點開始上課，到上午10點下課。請問老師上課花了幾個小時？",
            "奇奇下午4點20分放學，走路回家花了30分鐘。請問奇奇回到家是幾點幾分？",
            "小明下午4點放學後，又上了3個小時的才藝班才回家。請問，小明幾點才下課回家？",
            "阿莫昨天睡了9時40分，前天睡了8時35分。請問，阿莫昨天比前天多睡幾時幾分？",
            "快樂國小兒童節慶祝活動從上午9時20分開始，一共進行了2小時20分。請問，結束時間是上午幾時幾分？",
            "同學們進行了50米賽跑。軍軍用了14秒，比阿樂多用了1秒，比小偉少用了2秒。在三人中，誰跑得最快，誰跑得最慢？",
            "三年二班有四位同學參加100米，跑完成績分別為：、22秒、21秒、25秒、26秒，請問最快的用了多少秒？",
            "遊樂場上午10：00開門，小珍上午9：50到達，她應該是早到還是晚到？",
            "郵局早上8：00開門，爸爸早上9：00到達，他有超過開門的時間嗎？",
            "茵茵從家裡走到學校要花35分，她在上午7時18分從家裡出發，什麼時刻會到達學校？",
            "從台北搭7時40分的飛機往澎湖，飛機在8時25分到達澎湖馬公，請問這架飛機大約飛行了多少時間？",
            "小可全家人到外婆家過聖誕節，他們從12月20日待到12月25日。請問小可一家人總共在外婆家待了幾天？",
            "2020年的前半年，也就是1月到6月，共有幾天？",
            "2020年的後半年，也就是7月到12月，共有幾天？",
            "時針在鐘面上走2圈是經過多少時間？",
            "鐘面上，短針停在11，長針停在6。請問指的是幾點？"
    };

    private String mChoices[][] = {
            {"(A)6天", "(B)7天", "(C)8天", "(D)9天"},
            {"(A)12小時", "(B)24小時", "(C)10小時", "(D)2小時"},
            {"(A)122小時", "(B)144小時", "(C)111小時", "(D)133小時"},
            {"(A)12分鐘", "(B)24分鐘", "(C)60分鐘", "(D)120分鐘"},
            {"(A)120分鐘", "(B)240分鐘", "(C)300分鐘", "(D)480分鐘"},
            {"(A)12秒", "(B)24秒", "(C)60秒", "(D)120秒"},
            {"(A)120秒", "(B)1200秒", "(C)480秒", "(D)4800秒"},
            {"(A)80分", "(B)82分", "(C)83分", "(D)84分"},
            {"(A)400秒", "(B)410秒", "(C)420秒", "(D)430秒"},
            {"(A)480分鐘", "(B)240分鐘", "(C)180分鐘", "(D)300分鐘"},
            {"(A)300秒", "(B)600秒", "(C)1200秒", "(D)1800秒"},
            {"(A)120秒", "(B)140秒", "(C)180秒", "(D)240秒"},
            {"(A)185秒", "(B)195秒", "(C)205秒", "(D)215秒"},
            {"(A)24小時", "(B)12小時", "(C)10小時", "(D)2小時"},
            {"(A)早上7點", "(B)晚上7點", "(C)中午12點", "(D)晚上9點"},
            {"(A)72小時", "(B)24小時", "(C)96小時", "(D)48小時"},
            {"(A)1日", "(B)2日", "(C)3日", "(D)4日"},
            {"(A)1小時", "(B)2小時", "(C)3小時", "(D)4小時"},
            {"(A)日", "(B)小時", "(C)分", "(D)秒"},
            {"(A)63分鐘", "(B)73分鐘", "(C)83分鐘", "(D)93分鐘"},
            {"(A)30小時", "(B)31小時", "(C)32小時", "(D)33小時"},
            {"(A)8時55分", "(B)8時45分", "(C)8時35分", "(D)8時25分"},
            {"(A)2分15秒", "(B)3分15秒", "(C)1分35秒", "(D)2分35秒"},
            {"(A)3分18秒", "(B)6分18秒", "(C)3分48秒", "(D)6分48秒"},
            {"(A)3份", "(B)4份", "(C)5份", "(D)6份"},
            {"(A)10小時", "(B)11小時", "(C)24小時", "(D)25小時"},
            {"(A)416小時", "(B)122小時", "(C)112小時", "(D)102小時"},
            {"(A)3分35秒", "(B)3分45秒", "(C)4分35秒", "(D)4分45秒"},
            {"(A)18小時", "(B)6日12小時", "(C)6日22小時", "(D)17小時"},
            {"(A)16小時", "(B)24.6小時", "(C)25日18小時", "(D)25日15小時"},
            {"(A)1小時", "(B)2小時", "(C)11小時", "(D)12小時"},
            {"(A)4點50分", "(B)4點30分", "(C)5點30分", "(D)5點50分"},
            {"(A)晚上6點", "(B)晚上7點", "(C)晚上8點", "(D)晚上9點"},
            {"(A)5分", "(B)15分", "(C)1時5分", "(D)1時15分"},
            {"(A)10時20分", "(B)10時40分", "(C)11時20分", "(D)11時40分"},
            {"(A)阿樂最快；小偉最慢", "(B)軍軍最快；小偉最慢", "(C)小偉最快；軍軍最慢", "(D)小偉最快；阿樂最慢"},
            {"(A)23秒", "(B)21秒", "(C)26秒", "(D)25秒"},
            {"(A)早到", "(B)晚到", "(C)不確定", "(D)題目資訊量不足，無法判斷"},
            {"(A)有", "(B)沒有", "(C)不確定", "(D)題目資訊量不足，無法判斷"},
            {"(A)7時53分", "(B)7時58分", "(C)8時53分", "(D)8時58分"},
            {"(A)25分", "(B)45分", "(C)1小時45分", "(D)1小時25分"},
            {"(A)5天", "(B)6天", "(C)7天", "(D)8天"},
            {"(A)181天", "(B)182天", "(C)183天", "(D)184天"},
            {"(A)182天", "(B)183天", "(C)184天", "(D)185天"},
            {"(A)120秒", "(B)20分鐘", "(C)24小時", "(D)2日"},
            {"(A)11：06", "(B)11：30", "(C)06：11", "(D)06：30"},
    };

    private String mCorrectAnswers[] = {
            "(B)7天",
            "(B)24小時",
            "(B)144小時",
            "(C)60秒",
            "(C)300分鐘",
            "(C)60秒",
            "(B)1200秒",
            "(C)83分",
            "(B)410秒",
            "(D)300分鐘",
            "(B)600秒",
            "(A)120秒",
            "(A)185秒",
            "(B)12小時",
            "(B)晚上7點",
            "(A)72小時",
            "(B)2日",
            "(A)1小時",
            "(B)小時",
            "(D)93分鐘",
            "(C)32小時",
            "(C)8時35分",
            "(A)2分15秒",
            "(D)6分48秒",
            "(B)4份",
            "(B)11小時",
            "(C)112小時",
            "(B)3分45秒",
            "(B)6日12小時",
            "(D)25日15小時",
            "(A)1小時",
            "(A)4點50分",
            "(B)晚上7點",
            "(C)1時5分",
            "(D)11時40分",
            "(A)阿樂最快；小偉最慢",
            "(B)21秒",
            "(A)早到",
            "(A)有",
            "(A)7時53分",
            "(B)45分",
            "(B)6天",
            "(B)182天",
            "(C)184天",
            "(C)24小時",
            "(B)11：30"
    };

    public String formula() {
        String formula = "‧時間：\n" +
                "一分鐘=60 秒；\n" +
                "一小時=60 分鐘；\n" +
                "一天=24 小時；\n" +
                "‧分和秒的加法：\n" +
                "分、秒先對齊；\n" +
                "秒先加。秒加秒、分加分；\n" +
                "超過 60 秒，進位為 1 分；\n" +
                "‧分和秒的減法：\n" +
                "分、秒先對齊；\n" +
                "秒先減，不夠像分借。；\n" +
                "秒減秒、分減分；\n" +
                "分和時、日和時，以此類推；";
        return formula;
    }

    private String mprompt[] = {
            "平日5天+假日2天",
            "1天=24小時",
            "1天=24小時",
            "1小時=60分鐘",
            "1小時=60分鐘",
            "1分鐘=60秒",
            "1分鐘=60秒",
            "透過1時＝60分，將時轉換成分後，再運用加法計算。",
            "透過1時＝60分，將分轉換成秒後，再運用加法計算。",
            "1小時=60分鐘",
            "1分鐘=60秒",
            "1分鐘=60秒",
            "透過1時＝60分，將分轉換成秒後，再運用加法計算。",
            "上午8點到隔天上午8點是經過24小時，到當日晚上8點則是一半",
            "1天有24小時，差12小時就是時間不變，白天跟晚上的差別。",
            "1天=24小時",
            "1天=24小時",
            "1小時=60分鐘",
            "想想你睡覺都睡多久，怎麼樣才算合理☺",
            "透過1時＝60分，將時轉換成分後，再運用加法計算。",
            "透過1日＝24時，將日轉換成時後，再運用加法計算。",
            "透過1時＝60分，將時轉換成分後，再運用加法計算。",
            "透過1分＝60秒，運用除法解題。135÷60＝2..15，所得到的商是幾分(2分)，餘數就是幾秒(15秒)。",
            "透過1分＝60秒，將分轉換成秒後，再運用乘法計算。",
            "透過1時＝60分，將時轉換成分後，再運用除法計算。",
            "透過1日＝24時，將日轉換成時後，再運用除法計算。",
            "透過1日＝24時，將日轉換成時後，再運用乘法計算。",
            "---寫成直式時，單位要對好，例：時對時、分對分。先算秒，再算分。15秒X3＝45秒、1分X3＝3分",
            "寫成直式時，單位要對好，例：時對時、分對分。先算時，再算日。4時X3＝12時、2日X3＝6日",
            "寫成直式時，單位要對好，例：時對時、分對分。先算時，再算日。3時X5＝15時、5日X5＝25日",
            "10點–9點",
            "分鐘+分鐘",
            "小時+小時",
            "分鐘–分鐘；時–時",
            "分鐘+分鐘；時+時",
            "軍軍比阿樂多，所以軍軍比阿樂慢；軍軍比小偉少，所以軍軍比小偉快",
            "秒數少的最快",
            "9：50比10：00早",
            "9：00比8：00晚",
            "-寫成直式時，單位要對好，例：時對時、分對分。先算分，再算時。",
            "寫成直式時，單位要對好，例：時對時、分對分。先算分，再算時。",
            "從20日開始算第一天，算到25日。",
            "1月有31天；2月有29天；3月有31天；4月有30天；5月有31天；6月有30天",
            "7月有31天；8月有31天；9月有30天；10月有31天；11月有30天；12月有31天",
            "鐘面走一1圈為12小時",
            "短針是時針；長針是分針"
    };

    public String getprompt(int a) {
        String prompt = mprompt[a];
        return prompt;
    }

    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice = mChoices[a][0];
        return choice;
    }

    public String getChoice2(int a) {
        String choice = mChoices[a][1];
        return choice;
    }

    public String getChoice3(int a) {
        String choice = mChoices[a][2];
        return choice;
    }

    public String getChoice4(int a) {
        String choice = mChoices[a][3];
        return choice;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
